Sample terraform plan (redacted account id):
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam_param_store.aws_iam_policy.app_param_store will be created
  + resource "aws_iam_policy" "app_param_store" {
      + arn         = (known after apply)
      + description = "Read-only permissions to environment scoped parameter store variables"
      + id          = (known after apply)
      + name        = "bb-test-app-parameter-store"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:DescribeParameters",
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:XXX:parameter/bb2/test/app/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam_param_store.aws_iam_role_policy_attachment.app_param_store will be created
  + resource "aws_iam_role_policy_attachment" "app_param_store" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bb-test-app-role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```